In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib as mpl
mm = 1/25.4
plt.rcParams['font.family']= "Times New Roman"
mpl.rcParams['xtick.labelsize'] = 10
mpl.rcParams['ytick.labelsize'] = 10
plt.rcParams['mathtext.fontset']='cm'
plt.style.use('tableau-colorblind10')
df_deal = pd.read_csv('../data/tianchi_mobile_recommend_train_user.csv')
df_item = pd.read_csv('../data/tianchi_mobile_recommend_train_item.csv')
print('The length of the deal is',len(df_deal))
print('The length of the item is ',len(df_item))

The length of the deal is 12256906
The length of the item is  480723

In [2]:
df_deal.head()

,user_id,item_id,behavior_type,user_geohash,item_category,time
0,98047837,232431562,1,NaN,4245,2014-12-06 02
1,97726136,383583590,1,NaN,5894,2014-12-09 20
2,98607707,64749712,1,NaN,2883,2014-12-18 11
3,98662432,320593836,1,96nn52n,6562,2014-12-06 10
4,98145908,290208520,1,NaN,13926,2014-12-16 21

In [3]:
df_item.head()

     item_id item_geohash  item_category
0  312051294          NaN           8270
1   99999754          NaN           7393
2  131746128          NaN           7876
3  385731330          NaN          10544
4  100004415          NaN           3064

## 探索性分析

In [4]:
# 用户数量有多少
print('The total user is',len(np.unique(df_deal['user_id'])))

The total user is 10000